In [1]:
import pandas as pd

In [2]:
full_df = pd.read_csv('full_df')

In [4]:
full_df.drop(columns='Unnamed: 0', inplace=True)

In [5]:
full_df

                 timestamp  customer_no  location     day
0      2019-09-02 07:03:00            1     dairy  Monday
1      2019-09-02 07:04:00            1     dairy  Monday
2      2019-09-02 07:05:00            1  checkout  Monday
3      2019-09-02 07:03:00            2     dairy  Monday
4      2019-09-02 07:04:00            2     dairy  Monday
...                    ...          ...       ...     ...
54075  2019-09-06 21:51:00         9510    spices  Friday
54076  2019-09-06 21:52:00         9510    spices  Friday
54077  2019-09-06 21:53:00         9510    spices  Friday
54078  2019-09-06 21:54:00         9510    spices  Friday
54079  2019-09-06 21:55:00         9510  checkout  Friday

[54080 rows x 4 columns]

In [6]:
full_df['next_location'] = full_df['location'].shift(-1)

In [7]:
full_df.groupby('location')['next_location'].value_counts()

location  next_location
checkout  fruit             2810
          dairy             2140
          spices            1351
          drinks            1143
dairy     dairy            13172
          checkout          1839
          drinks            1041
          spices             913
          fruit              886
drinks    drinks            5830
          checkout          2098
          fruit              855
          spices             846
          dairy              106
fruit     fruit             7624
          checkout          2562
          dairy             1219
          drinks             697
          spices             644
spices    spices            2549
          dairy             1213
          drinks            1024
          checkout           946
          fruit              571
Name: next_location, dtype: int64

In [8]:
full_df.groupby('location')['next_location'].value_counts().unstack()

next_location  checkout    dairy  drinks   fruit  spices
location
checkout            NaN   2140.0  1143.0  2810.0  1351.0
dairy            1839.0  13172.0  1041.0   886.0   913.0
drinks           2098.0    106.0  5830.0   855.0   846.0
fruit            2562.0   1219.0   697.0  7624.0   644.0
spices            946.0   1213.0  1024.0   571.0  2549.0

In [9]:
full_df.groupby('location')['next_location'].value_counts(normalize=True).unstack()

next_location  checkout     dairy    drinks     fruit    spices
location
checkout            NaN  0.287480  0.153546  0.377485  0.181488
dairy          0.103019  0.737886  0.058316  0.049633  0.051146
drinks         0.215511  0.010889  0.598870  0.087827  0.086903
fruit          0.201004  0.095638  0.054684  0.598148  0.050526
spices         0.150087  0.192448  0.162462  0.090592  0.404411